In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([9904312, 3448737, 2890451, 2466052], 
               index=['서울','부산','인천','대구'])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [3]:
s1 = pd.Series([9904312, 3448737, 2890451, 1490158], 
                index=['서울','부산','인천','대전'])
s1

서울    9904312
부산    3448737
인천    2890451
대전    1490158
dtype: int64

In [4]:
s + 1000

서울    9905312
부산    3449737
인천    2891451
대구    2467052
dtype: int64

In [5]:
s - 100

서울    9904212
부산    3448637
인천    2890351
대구    2465952
dtype: int64

In [7]:
s1 * 3

서울    29712936
부산    10346211
인천     8671353
대전     4470474
dtype: int64

In [9]:
s1 / 2

서울    4952156.0
부산    1724368.5
인천    1445225.5
대전     745079.0
dtype: float64

In [27]:
data = { 
    '2020': [9831482, 3693191, 2632035, 2531774, 1838290], 
    '2015': [9762514, 3526890, 2517847, 2456072, 1781389], 
    '2010': [9853711, 3655437, 2466339, 2473990, 1620465], 
    '지역': ['수도권', '경상권', '수도권', '경상권', '수도권'], 
    '2015-2020 증가율': [0.7, 4.7, 4.5, 3.1, 3.2]
}
columns = ['지역', '2020', '2015', '2010', '2015-2020 증가율']
index = ['서울', '부산', '인천', '대구', '과천']
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2020     2015     2010  2015-2020 증가율
서울  수도권  9831482  9762514  9853711            0.7
부산  경상권  3693191  3526890  3655437            4.7
인천  수도권  2632035  2517847  2466339            4.5
대구  경상권  2531774  2456072  2473990            3.1
과천  수도권  1838290  1781389  1620465            3.2

In [28]:
data = {
    '국어': [80, 90, 70, 30],
    '영어': [90, 70, 60, 40], 
    '수학': [90, 60, 80, 70]
}
columns = ['국어', '영어', '수학']
index = ['춘향', '몽룡', '향단', '방자']
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [29]:
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [30]:
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [31]:
np.mean(df.values, axis = 1)

array([86.66666667, 73.33333333, 70.        , 46.66666667])

In [32]:
df.mean(axis = 1)

춘향    86.666667
몽룡    73.333333
향단    70.000000
방자    46.666667
dtype: float64

In [34]:
df['평균'] = ((df.mean(axis=1)).round(2))
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67